{"format":"layers-model","generatedBy":"keras v3.13.2","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.2","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"name":"input_layer","batch_input_shape":[null,60,1662]}},{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"seed":null,"gain":1.0}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.01}},"recurrent_regularizer":null,"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.05}},"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.4}},{"class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"seed":null,"gain":1.0}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.01}},"recurrent_regularizer":null,"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.05}},"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_1","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.4}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.05}},"kernel_constraint":null,"bias_constraint":null}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_2","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":"float32","rate":0.4}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.05}},"kernel_constraint":null,"bias_constraint":null}}]}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"dense/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense/bias","shape":[32],"dtype":"float32"},{"name":"dense_1/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_1/bias","shape":[4],"dtype":"float32"},{"name":"layer_normalization/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization/beta","shape":[64],"dtype":"float32"},{"name":"layer_normalization_1/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_1/beta","shape":[64],"dtype":"float32"},{"name":"layer_normalization_2/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_2/beta","shape":[32],"dtype":"float32"},{"name":"lstm/lstm_cell/kernel","shape":[1662,256],"dtype":"float32"},{"name":"lstm/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"}]}]}