{"format":"layers-model","generatedBy":"keras v3.8.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.8.0","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"InputLayer","config":{"batch_shape":[null,60,1662],"dtype":"float32","sparse":false,"name":"input_layer"}},{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.01},"registered_name":null},"recurrent_regularizer":null,"bias_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.05},"registered_name":null},"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.4,"seed":null,"noise_shape":null}},{"class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.01},"registered_name":null},"recurrent_regularizer":null,"bias_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.05},"registered_name":null},"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.4,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.01},"registered_name":null},"bias_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.05},"registered_name":null},"kernel_constraint":null,"bias_constraint":null}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.4,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":{"module":"keras.regularizers","class_name":"L2","config":{"l2":0.05},"registered_name":null},"kernel_constraint":null,"bias_constraint":null}}],"build_input_shape":[null,60,1662]}},"training_config":{"loss":"categorical_crossentropy","loss_weights":null,"metrics":["categorical_accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"RMSprop","config":{"name":"rmsprop","learning_rate":0.0010000000474974513,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"rho":0.9,"momentum":0.0,"epsilon":1e-07,"centered":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"dense/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense/bias","shape":[32],"dtype":"float32"},{"name":"dense_1/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_1/bias","shape":[4],"dtype":"float32"},{"name":"layer_normalization/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization/beta","shape":[64],"dtype":"float32"},{"name":"layer_normalization_1/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_1/beta","shape":[64],"dtype":"float32"},{"name":"layer_normalization_2/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_2/beta","shape":[32],"dtype":"float32"},{"name":"lstm/lstm_cell/kernel","shape":[1662,256],"dtype":"float32"},{"name":"lstm/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"}]}]}